In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('London_Housing.csv')

In [4]:
data.shape

(13549, 6)

In [7]:
data.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

In [8]:
data.head(3)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN

In [8]:
#1. Convert date column to datetime format.

In [11]:
pd.to_datetime(data['date'])

0       1995-01-01
1       1995-02-01
2       1995-03-01
3       1995-04-01
4       1995-05-01
           ...
13544   2019-09-01
13545   2019-10-01
13546   2019-11-01
13547   2019-12-01
13548   2020-01-01
Name: date, Length: 13549, dtype: datetime64[ns]

In [14]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

In [15]:
#2. a) Add new column 'Year', which contains years only.

In [16]:
data.head(3)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN

In [21]:
#data['date']

In [104]:
data['Year'] = data['date'].dt.year

In [52]:
#   b) Add 'Month' as the second column, which contains months only.

In [107]:
data.insert(1, 'Month', data['date'].dt.month_name())

In [108]:
data.head(3)

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,January,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,February,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,March,city of london,79121,E09000001,14.0,NaN,1995

In [34]:
#3. Remove columns years & months.

In [109]:
data.drop(columns = ['Year', 'Month'])

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,NaN
13545,2019-10-01,england,249376,E92000001,68677.0,NaN
13546,2019-11-01,england,248515,E92000001,67814.0,NaN
13547,2019-12-01,england,250410,E92000001,NaN,NaN
13548,2020-01-01,england,247355,E92000001,NaN,NaN

In [110]:
data.head(3)

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,January,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,February,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,March,city of london,79121,E09000001,14.0,NaN,1995

In [70]:
#4. Show all record where number of crimes is zero.

In [71]:
data['no_of_crimes'].value_counts()

no_of_crimes
0.0       104
2039.0     11
1956.0     11
2276.0     10
2114.0     10
         ...
1947.0      1
3493.0      1
3614.0      1
3241.0      1
6405.0      1
Name: count, Length: 2669, dtype: int64

In [73]:
data[data['no_of_crimes'] == 0]

,date,area,average_price,code,houses_sold,no_of_crimes
72,2001-01-01,city of london,284262,E09000001,24.0,0.0
73,2001-02-01,city of london,198137,E09000001,37.0,0.0
74,2001-03-01,city of london,189033,E09000001,44.0,0.0
75,2001-04-01,city of london,205494,E09000001,38.0,0.0
76,2001-05-01,city of london,223459,E09000001,30.0,0.0
...,...,...,...,...,...,...
178,2009-11-01,city of london,397909,E09000001,11.0,0.0
179,2009-12-01,city of london,411955,E09000001,16.0,0.0
180,2010-01-01,city of london,464436,E09000001,20.0,0.0
181,2010-02-01,city of london,490525,E09000001,9.0,0.0
182,2010-03-01,city of london,498241,E09000001,15.0,0.0

In [74]:
len(data[data['no_of_crimes'] == 0])

104

In [75]:
#5. Calculate the max & min average prices per year in England.

In [112]:
data.head(3)

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,January,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,February,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,March,city of london,79121,E09000001,14.0,NaN,1995

In [113]:
data['average_price'].min()

40722

In [114]:
data['average_price'].max()

1463378

In [115]:
eng = data[data['area'] == 'england']

In [116]:
eng.head()

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
13248,1995-01-01,January,england,53203,E92000001,47639.0,NaN,1995
13249,1995-02-01,February,england,53096,E92000001,47880.0,NaN,1995
13250,1995-03-01,March,england,53201,E92000001,67025.0,NaN,1995
13251,1995-04-01,April,england,53591,E92000001,56925.0,NaN,1995
13252,1995-05-01,May,england,53678,E92000001,64192.0,NaN,1995

In [143]:
eng.groupby('Year').average_price.min()\
#.sort_values(ascending = False)

Year
1995     52788
1996     52333
1997     55789
1998     61659
1999     65522
2000     75219
2001     84245
2002     96215
2003    121610
2004    139719
2005    158572
2006    166544
2007    181824
2008    165795
2009    159340
2010    174458
2011    173046
2012    174161
2013    176816
2014    188265
2015    202856
2016    220361
2017    231593
2018    240428
2019    243281
2020    247355
Name: average_price, dtype: int64

In [146]:
eng.groupby('Year').average_price.max()\
#.sort_values(ascending = False)

Year
1995     53901
1996     55755
1997     61564
1998     65743
1999     75071
2000     84191
2001     95992
2002    119982
2003    138985
2004    160330
2005    167244
2006    182031
2007    194764
2008    191750
2009    174136
2010    180807
2011    177335
2012    180129
2013    188544
2014    203639
2015    219582
2016    231922
2017    242628
2018    248620
2019    250410
2020    247355
Name: average_price, dtype: int64

In [151]:
eng.groupby('Year').average_price.mean().round(2)

Year
1995     53322.42
1996     54151.50
1997     59160.67
1998     64301.67
1999     70070.75
2000     80814.33
2001     90306.75
2002    107981.50
2003    130218.58
2004    152314.42
2005    163570.00
2006    174351.50
2007    190025.58
2008    182379.92
2009    166558.67
2010    177472.67
2011    175230.00
2012    177488.00
2013    182581.42
2014    197771.08
2015    211174.75
2016    227337.17
2017    238161.17
2018    245018.33
2019    247101.08
2020    247355.00
Name: average_price, dtype: float64

In [127]:
#6. Calculate the max & min number of crimes per area.

In [128]:
data.head(3)

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,January,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,February,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,March,city of london,79121,E09000001,14.0,NaN,1995

In [138]:
data.groupby('area').no_of_crimes.min()\
.sort_values(ascending = False)

area
westminster               3504.0
lambeth                   2381.0
southwark                 2267.0
newham                    2130.0
camden                    2079.0
croydon                   2031.0
islington                 1871.0
ealing                    1871.0
hackney                   1870.0
brent                     1850.0
barnet                    1703.0
lewisham                  1675.0
tower hamlets             1646.0
enfield                   1635.0
wandsworth                1582.0
waltham forest            1575.0
haringey                  1536.0
hounslow                  1529.0
greenwich                 1513.0
redbridge                 1487.0
hillingdon                1445.0
bromley                   1441.0
kensington and chelsea    1347.0
hammersmith and fulham    1323.0
barking and dagenham      1217.0
havering                  1130.0
harrow                     937.0
bexley                     860.0
merton                     819.0
sutton                     787.0
richmond upon thames       700.0
kingston upon thames       692.0
city of london               0.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [139]:
data.groupby('area').no_of_crimes.max()\
.sort_values(ascending = False)

area
westminster               7461.0
lambeth                   4701.0
camden                    4558.0
southwark                 3821.0
newham                    3668.0
hackney                   3466.0
ealing                    3401.0
islington                 3384.0
tower hamlets             3316.0
croydon                   3263.0
haringey                  3199.0
wandsworth                3051.0
waltham forest            2941.0
brent                     2937.0
barnet                    2893.0
greenwich                 2853.0
hillingdon                2819.0
hounslow                  2817.0
lewisham                  2813.0
enfield                   2798.0
kensington and chelsea    2778.0
hammersmith and fulham    2645.0
bromley                   2637.0
redbridge                 2560.0
barking and dagenham      2049.0
havering                  1956.0
bexley                    1914.0
harrow                    1763.0
merton                    1623.0
richmond upon thames      1551.0
sutton                    1425.0
kingston upon thames      1379.0
city of london              10.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [152]:
#7. Calculate the total counts of records of each area where average price is less than 100k.

In [155]:
data.head(3)

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,January,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,February,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,March,city of london,79121,E09000001,14.0,NaN,1995

In [166]:
data[data['average_price'] < 100000].area.value_counts()

area
north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
lambeth                  41
hounslow                 41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: count, dtype: int64